function getRandomNum(max) {
    return Math.floor(Math.random() * max);
}

// Для прикладу використання цієї фунції
// let arr = genArray(100); виведе
// function genArray(size) {
//     let arr = []
//     for (let i = 0; i < size; i++) {
//         arr[i] = getRandomNum(i + 100);
//     }
//     return arr;
// }

// console.log(genArray(20));

// Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

// let arr = [];

// arr[0] = 1; //number
// arr[1] = 'hello'; //string

// console.log(arr);

// Створити масив з будь-якою кількістю елементів різного типу (string, number, boolean) та
// вивести в консоль лише цифри
// вивести в консоль лише   , які мають 4 та більше символів.
// вивести лише булівські значення true

// let arr = [
//     1,
//     -2,
//     'ok',
//     'help',
//     'student',
//     'with',
//     true,
//     [],
//     999,
//     2.3,
//     '',
//     false
// ];
// for (let element of arr) {
//     if (Number.isFinite(element)) {
//         console.log('NUMBER: ', element); // Number.isFinite() Documentation
//     }

//     if (element.length >= 4) {
//         console.log('STRING (lenght >= 4) ', element);
//     }

//     if (!!element) {
//         console.log('BOOLEAN (TRUE) ', element);
//     }
// }

// - Створити масив з 100 ітерацій, та вивести:
// - кожен індекс
// - тільки парні індекси (2, 4, 6, 8 ...)
// - індекси кратні 3 (3, 9, 12, 15 ...)

// let newArr = [];

// for (let i = 0; i < 100; i++) {
//     newArr[i] = getRandomNum(i + 5);
// }
// const newArr1 = newArr.map((value) => `Element ${value}`);
// console.log(newArr1);

// const newArr2 = newArr.map((value) => {
//     if ((value % 2) == 0) {
//         return value;
//     } else {
//         delete value
//     }
// });
// console.log(newArr2);

// const newArr3 = newArr.map((value) => {
//     if ((value % 3) == 0) {
//         return value;
//     } else {
//         delete value
//     }
// });
// console.log(newArr3);

// - Дано масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()
// - Дано масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
// const arr = ['js', 'css', 'jq'];
// console.log(arr.shift());
// console.log(arr.pop());

// - Дано масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
//     Підказка. Необхідно стерти елементи, зберегти їх кудись. Дописати букви і після букв повернути стерті цифри
// let arr = [1, 2, 3, 4, 5];
// arr.splice(3, 0, 'a', 'b', 'c');
// console.log(arr)
// - Дан масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
//     Підказка. Працюйте по принципу задачі вище.

// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
// let newArr = [];

// for (let i = 0; i < 10; i++) {
//     newArr[i] = getRandomNum(i + 5);
// }

// for (let element of newArr) {
//     console.log(element);
// }

// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
//easy
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.
//easy

// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
// let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18]
// 1. перебрати його циклом while - THIS ease
// let i = 0;
// while (i < arr.length) {
//     console.log(arr[i]);
//     i++;
// }
// 2. перебрати його циклом for - THIS ease
// ...
// 3. перебрати циклом while та вивести  числа тільки з непарним індексом - index % 2 == 1
// ...
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні значення - index % 2 == 0
// 6. перебрати циклом for та вивести  числа тільки парні значення
// 7. замінити кожне число кратне 3 на ваше імя if (element % 3 == 0) {element = 'Ruslan'}
// 8. вивести масив в зворотньому порядку. array.reversed()
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// 10

//  створити пустий масив та :
// - заповнити його 50 парними числами за допомоги циклу.
// - заповнити його 50 непарними числами за допомоги циклу.

// let arr1 = [];
// let arr2 = [];
// let i = 1;

// while (true) {
//     console.log(i);
//     (i % 2 === 0) ? arr1.push(i) : arr2.push(i)
//     i++;
// }
// console.log(arr1, arr2);

// 1. Створити пустий масив та :
//        a. заповнити його 50 парними числами за допомоги циклу.
//        b. заповнити його 50 непарними числами за допомоги циклу.
//        c. Заповнити масив 20ма рандомними числами. (Google: Generate random number JS)
//        d. Заповнити масив 20ма рандомними чисалами в діапазоні від 8 до 732 (Google: Generate random number JS)
//  2. Вивести за допомогою console.log кожен третій елемен
//  3. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним.
//  4. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним та записати їх в новий масив

//  5. Вивести кожен елемент масиву, сусід справа якого є парним
//   EXAMPLE: [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ] -> Має бути виведено 1, 9, 56

// let arr = [1, 2, 3, 5, 7, 9, 56, 8, 67];
// let newArr = [];
// for (let i = 0; i < arr.length; i++) {
//     if (arr[i] % 2 === 0) {
//         newArr.push(arr[i - 1]);
//     }
// }
// console.log(newArr);

//  6. Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. Обрахувати середній чек.

// let arrChecks = [100, 250, 50, 168, 120, 345, 188];
// let averageCheck = 0;
// let acc = 0;

// for (let element of arrChecks) {
//     acc += element;
// }

// averageCheck = acc / arrChecks.length;

// console.log(averageCheck);

//  7. Створити масив з рандомними з їх в інший масив значеннями, помножити всі його елементи на 5 та перемістити. - this easy
//  8. Створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо елемент є числом - додати його в інший масив. - this easy
